# 데이터 핸들링을 위한 판다스 기초1

In [1]:
# 학습 전 반드시 실행: csv파일 (data.csv) 생성
import pandas as pd
data = {
    "메뉴":['아메리카노','카페라떼','카페모카', '바닐라라떼', '녹차', '초코라떼', '바닐라콜드브루'],
    "가격":[4100, 4600, 4600, 5100, 4100, 5000, 5100],
    "할인율":[0.5, 0.1, 0.2, 0.3, 0, 0, 0],
    "칼로리":[10, 180, 420, 320, 20, 500, 400],
}
data = pd.DataFrame(data)
data.to_csv('data.csv', index=False)

## 라이브러리 불러오기

In [2]:
import pandas as pd

## 데이터 불러오기

In [5]:
# 데이터 불러오기
df = pd.read_csv('data.csv')
df

        메뉴    가격  할인율  칼로리
0    아메리카노  4100  0.5   10
1     카페라떼  4600  0.1  180
2     카페모카  4600  0.2  420
3    바닐라라떼  5100  0.3  320
4       녹차  4100  0.0   20
5     초코라떼  5000  0.0  500
6  바닐라콜드브루  5100  0.0  400

In [6]:
# 데이터 샘플 확인
df.head()

      메뉴    가격  할인율  칼로리
0  아메리카노  4100  0.5   10
1   카페라떼  4600  0.1  180
2   카페모카  4600  0.2  420
3  바닐라라떼  5100  0.3  320
4     녹차  4100  0.0   20

In [7]:
# 데이터 샘플 확인
df.tail()

        메뉴    가격  할인율  칼로리
2     카페모카  4600  0.2  420
3    바닐라라떼  5100  0.3  320
4       녹차  4100  0.0   20
5     초코라떼  5000  0.0  500
6  바닐라콜드브루  5100  0.0  400

## 데이터 프레임과 시리즈

In [11]:
# 시리즈 만들기 (문자열)
menu = pd.Series(['아아','아라','바콜'])
menu

0    아아
1    아라
2    바콜
dtype: object

In [12]:
# 시리즈 만들기 (정수형)
price = pd.Series([2000, 3000, 4000])
price

0    2000
1    3000
2    4000
dtype: int64

In [13]:
# 데이터 프레임 만들기 pd.DataFrame({"컬럼명" : 데이터})
pd.DataFrame({
    "menu" : menu,
    "price" : price
})

  menu  price
0   아아   2000
1   아라   3000
2   바콜   4000

In [14]:
# 데이터 프레임 만들기 pd.DataFrame({"컬럼명":데이터})
data = {
    "메뉴":['아메리카노','카페라떼','카페모카'],
    "가격":[4100,4600,4600],
    "할인율":[0.5, 0.1, 0.2],
    "칼로리":[10, 180, 420],
}
cafe = pd.DataFrame(data)
cafe

      메뉴    가격  할인율  칼로리
0  아메리카노  4100  0.5   10
1   카페라떼  4600  0.1  180
2   카페모카  4600  0.2  420

In [15]:
# 시리즈 선택 (가격)
df['가격']

0    4100
1    4600
2    4600
3    5100
4    4100
5    5000
6    5100
Name: 가격, dtype: int64

In [17]:
# 데이터 프레임 선택 (가격)
df[['가격']]

     가격
0  4100
1  4600
2  4600
3  5100
4  4100
5  5000
6  5100

In [19]:
# 데이터프레임 type 확인
type(df)

pandas.core.frame.DataFrame

In [21]:
# 시리즈 type 확인
type(df['가격'])

pandas.core.series.Series

## EDA (탐색적 데이터 분석)

In [22]:
# 데이터 불러오기 (에러가 뜬다면 가장 첫번째 셀, csv 파일을 생성하는 코드 실행)
df = pd.read_csv('data.csv')

In [23]:
# 데이터 프레임 크기 (행, 컬럼)
df.shape

(7, 4)

In [24]:
# 컬럼 형태 (type)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   메뉴      7 non-null      object
 1   가격      7 non-null      int64
 2   할인율     7 non-null      float64
 3   칼로리     7 non-null      int64
dtypes: float64(1), int64(2), object(1)
memory usage: 352.0+ bytes

In [25]:
# 기초 통계
df.describe()

                가격       할인율         칼로리
count     7.000000  7.000000    7.000000
mean   4657.142857  0.157143  264.285714
std     435.343324  0.190238  196.965068
min    4100.000000  0.000000   10.000000
25%    4350.000000  0.000000  100.000000
50%    4600.000000  0.100000  320.000000
75%    5050.000000  0.250000  410.000000
max    5100.000000  0.500000  500.000000

In [26]:
# 기초 통계 (object)
df.describe(include='O')

           메뉴
count       7
unique      7
top     아메리카노
freq        1

In [27]:
# 상관관계
df.corr()

C:\Users\user\AppData\Local\Temp\ipykernel_35896\3439580613.py:2: FutureWarning: The default value of numeric_only in DataFrame.corr is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.corr()

           가격       할인율       칼로리
가격   1.000000 -0.327738  0.853837
할인율 -0.327738  1.000000 -0.390151
칼로리  0.853837 -0.390151  1.000000

In [28]:
# 중복 값이 있는 데이터 생성
car = {
    "car":['Sedan','SUV','Sedan','SUV','SUV','SUV','Sedan','Sedan','Sedan','Sedan','Sedan'],
    "size":['S','M','S','S','M','M','L','S','S', 'M','S']
}
car = pd.DataFrame(car)
car.head(3)

     car size
0  Sedan    S
1    SUV    M
2  Sedan    S

In [29]:
# 항목 종류 수 
car.nunique()

car     2
size    3
dtype: int64

In [31]:
# 항목 종류 
car['car'].unique()

array(['Sedan', 'SUV'], dtype=object)

In [32]:
# 항목 종류 
car['size'].unique()

array(['S', 'M', 'L'], dtype=object)

In [34]:
# 항목 별 개수
car['car'].value_counts()

Sedan    7
SUV      4
Name: car, dtype: int64

In [35]:
# 항목별 개수 
car['size'].value_counts()

S    6
M    4
L    1
Name: size, dtype: int64

## 자료형 변환

In [36]:
# 데이터 프레임 만들기 (할인율과 칼로리 -> 문자열)
data = {
    "메뉴":['아메리카노', '카페라떼', '카페모카', '바닐라콜드브루'],
    "가격":[4100, 4600, 4600, 5100],
    "할인율":['0.5', '0.1', '0.2', '0.3'],
    "칼로리":[10,180,420,320],
}
df = pd.DataFrame(data)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   메뉴      4 non-null      object
 1   가격      4 non-null      int64
 2   할인율     4 non-null      object
 3   칼로리     4 non-null      int64
dtypes: int64(2), object(2)
memory usage: 256.0+ bytes

In [39]:
# 자료형 변환 / astype / object -> float
df['할인율'] = df['할인율'].astype('float')

In [40]:
# 자료형 확인
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   메뉴      4 non-null      object
 1   가격      4 non-null      int64
 2   할인율     4 non-null      float64
 3   칼로리     4 non-null      int64
dtypes: float64(1), int64(2), object(1)
memory usage: 256.0+ bytes

## 새로운 컬럼 추가

In [41]:
df.head()

        메뉴    가격  할인율  칼로리
0    아메리카노  4100  0.5   10
1     카페라떼  4600  0.1  180
2     카페모카  4600  0.2  420
3  바닐라콜드브루  5100  0.3  320

In [42]:
# 새로운 컬럼 추가(값은 0)
df['new'] = 0
df

        메뉴    가격  할인율  칼로리  new
0    아메리카노  4100  0.5   10    0
1     카페라떼  4600  0.1  180    0
2     카페모카  4600  0.2  420    0
3  바닐라콜드브루  5100  0.3  320    0

In [43]:
# 할인가 컬럼 추가
df['할인가'] = df['가격'] * (1-df['할인율'])
df

        메뉴    가격  할인율  칼로리  new     할인가
0    아메리카노  4100  0.5   10    0  2050.0
1     카페라떼  4600  0.1  180    0  4140.0
2     카페모카  4600  0.2  420    0  3680.0
3  바닐라콜드브루  5100  0.3  320    0  3570.0

In [44]:
# 결측값으로 추가, 원두 컬럼을 만들고 결측값(NaN)으로 대입
import numpy as np

df['원두'] = np.nan
df

        메뉴    가격  할인율  칼로리  new     할인가  원두
0    아메리카노  4100  0.5   10    0  2050.0 NaN
1     카페라떼  4600  0.1  180    0  4140.0 NaN
2     카페모카  4600  0.2  420    0  3680.0 NaN
3  바닐라콜드브루  5100  0.3  320    0  3570.0 NaN

## 데이터 삭제

### 컬럼 삭제

In [46]:
# 데이터 삭제
# axis = 1 : 역방향 (컬럼) / axis = 0 : 행방향
df = df.drop('new', axis = 1)

In [47]:
# 데이터 확인
df.head()

        메뉴    가격  할인율  칼로리     할인가  원두
0    아메리카노  4100  0.5   10  2050.0 NaN
1     카페라떼  4600  0.1  180  4140.0 NaN
2     카페모카  4600  0.2  420  3680.0 NaN
3  바닐라콜드브루  5100  0.3  320  3570.0 NaN

### 행삭제

In [49]:
# 행 삭제
df = df.drop(1,axis=0)

In [50]:
# 데이터 확인
df.head()

        메뉴    가격  할인율  칼로리     할인가  원두
0    아메리카노  4100  0.5   10  2050.0 NaN
2     카페모카  4600  0.2  420  3680.0 NaN
3  바닐라콜드브루  5100  0.3  320  3570.0 NaN

## CSV 저장하기

In [51]:
# csv로 저장하기
df.to_csv('data2.csv', index=False)
# df.to_csv('data2.csv')

In [52]:
# csv 불러오기
new_df = pd.read_csv('data2.csv')
new_df.head()

        메뉴    가격  할인율  칼로리     할인가  원두
0    아메리카노  4100  0.5   10  2050.0 NaN
1     카페모카  4600  0.2  420  3680.0 NaN
2  바닐라콜드브루  5100  0.3  320  3570.0 NaN

# Quiz

In [53]:
# 주어진 데이터
data = {
    "메뉴":['아메리카노', '카페라떼', '카페모카', '바닐라콜드브루'],
    "가격":[4100, 4600, 4600, 5100],
    "할인율":['0.5', '0.1', '0.2', '0.3'],
    "칼로리":[10,180,420,320],
}
df = pd.DataFrame(data)
df

        메뉴    가격  할인율  칼로리
0    아메리카노  4100  0.5   10
1     카페라떼  4600  0.1  180
2     카페모카  4600  0.2  420
3  바닐라콜드브루  5100  0.3  320

**1. 이벤트가 컬럼 만들기**
- 원 가격의 50% 할인을 적용한 이벤트가격

In [54]:
df['이벤트가'] = df['가격'] * 0.5
df

        메뉴    가격  할인율  칼로리    이벤트가
0    아메리카노  4100  0.5   10  2050.0
1     카페라떼  4600  0.1  180  2300.0
2     카페모카  4600  0.2  420  2300.0
3  바닐라콜드브루  5100  0.3  320  2550.0

**2. 할인가 컬럼 만들기**
- 할인을 적용한 할인가격

In [58]:
df.info()
df['할인율'] = df['할인율'].astype('float')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   메뉴      4 non-null      object
 1   가격      4 non-null      int64
 2   할인율     4 non-null      float64
 3   칼로리     4 non-null      int64
 4   이벤트가    4 non-null      float64
dtypes: float64(2), int64(2), object(1)
memory usage: 288.0+ bytes
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   메뉴      4 non-null      object
 1   가격      4 non-null      int64
 2   할인율     4 non-null      float64
 3   칼로리     4 non-null      int64
 4   이벤트가    4 non-null      float64
dtypes: float64(2), int64(2), object(1)
memory usage: 288.0+ bytes

In [59]:
df['할인가'] = df['가격'] * (1-df['할인율'])
df

        메뉴    가격  할인율  칼로리    이벤트가     할인가
0    아메리카노  4100  0.5   10  2050.0  2050.0
1     카페라떼  4600  0.1  180  2300.0  4140.0
2     카페모카  4600  0.2  420  2300.0  3680.0
3  바닐라콜드브루  5100  0.3  320  2550.0  3570.0

**3. 컬럼 삭제**
- 칼로리 컬럼 삭제

In [61]:
df = df.drop('칼로리',axis = 1)
df

        메뉴    가격  할인율    이벤트가     할인가
0    아메리카노  4100  0.5  2050.0  2050.0
1     카페라떼  4600  0.1  2300.0  4140.0
2     카페모카  4600  0.2  2300.0  3680.0
3  바닐라콜드브루  5100  0.3  2550.0  3570.0